In [14]:
import seaborn as sns
import pandas as pd

In [2]:
df=sns.load_dataset('titanic')

In [3]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [10]:
mask_2 = (df.age<10)&(df.sex=='female')
df_female = df.loc[mask_2, :]
df_female

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.00,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
24,0,3,female,8.00,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
43,1,2,female,3.00,1,2,41.5792,C,Second,child,False,NaN,Cherbourg,yes,False
58,1,2,female,5.00,1,2,27.7500,S,Second,child,False,NaN,Southampton,yes,False
119,0,3,female,2.00,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
147,0,3,female,9.00,2,2,34.3750,S,Third,child,False,NaN,Southampton,no,False
172,1,3,female,1.00,1,1,11.1333,S,Third,child,False,NaN,Southampton,yes,False
184,1,3,female,4.00,0,2,22.0250,S,Third,child,False,NaN,Southampton,yes,False
205,0,3,female,2.00,0,1,10.4625,S,Third,child,False,G,Southampton,no,False
233,1,3,female,5.00,4,2,31.3875,S,Third,child,False,NaN,Southampton,yes,False
237,1,2,female,8.00,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
374,0,3,female,3.00,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
381,1,3,female,1.00,0,2,15.7417,C,Third,child,False,NaN,Cherbourg,yes,False
448,1,3,female,5.00,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
479,1,3,female,2.00,0,1,12.2875,S,Third,child,False,NaN,Southampton,yes,False
530,1,2,female,2.00,1,1,26.0000,S,Second,child,False,NaN,Southampton,yes,False
535,1,2,female,7.00,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False
541,0,3,female,9.00,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
618,1,2,female,4.00,2,1,39.0000,S,Second,child,False,F,Southampton,yes,False
634,0,3,female,9.00,3,2,27.9000,S,Third,child,False,NaN,Southampton,no,False
642,0,3,female,2.00,3,2,27.9000,S,Third,child,False,NaN,Southampton,no,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
691,1,3,female,4.00,0,1,13.4167,C,Third,child,False,NaN,Cherbourg,yes,False
720,1,2,female,6.00,0,1,33.0000,S,Second,child,False,NaN,Southampton,yes,False
750,1,2,female,4.00,1,1,23.0000,S,Second,child,False,NaN,Southampton,yes,False
777,1,3,female,5.00,0,0,12.4750,S,Third,child,False,NaN,Southampton,yes,True
813,0,3,female,6.00,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
852,0,3,female,9.00,1,1,15.2458,C,Third,child,False,NaN,Cherbourg,no,False

In [11]:
df_f=df.loc[(df.age<10) | (df.age >= 60)]
df_f=df.loc[mask_3, ['age', 'sex', 'alone']]
df_f.head()

NameError: name 'mask_3' is not defined

In [15]:
pd.set_option('display.max_columns',10)

In [16]:
df.head()

,survived,pclass,sex,age,sibsp,...,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,...,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,...,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,...,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,...,False,C,Southampton,yes,False
4,0,3,male,35.0,0,...,True,NaN,Southampton,no,True

In [17]:
mask_3=df['sibsp']==3
mask_4=df['sibsp']==4
mask_5=mask_3|==5

In [19]:
df['sibsp']==3

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: sibsp, Length: 891, dtype: bool

In [20]:
df[mask_3|mask_4|mask_5]

,survived,pclass,sex,age,sibsp,...,adult_male,deck,embark_town,alive,alone
7,0,3,male,2.0,3,...,False,NaN,Southampton,no,False
16,0,3,male,2.0,4,...,False,NaN,Queenstown,no,False
24,0,3,female,8.0,3,...,False,NaN,Southampton,no,False
27,0,1,male,19.0,3,...,True,C,Southampton,no,False
50,0,3,male,7.0,4,...,False,NaN,Southampton,no,False
59,0,3,male,11.0,5,...,False,NaN,Southampton,no,False
63,0,3,male,4.0,3,...,False,NaN,Southampton,no,False
68,1,3,female,17.0,4,...,False,NaN,Southampton,yes,False
71,0,3,female,16.0,5,...,False,NaN,Southampton,no,False
85,1,3,female,33.0,3,...,False,NaN,Southampton,yes,False
88,1,1,female,23.0,3,...,False,C,Southampton,yes,False
119,0,3,female,2.0,4,...,False,NaN,Southampton,no,False
164,0,3,male,1.0,4,...,False,NaN,Southampton,no,False
171,0,3,male,4.0,4,...,False,NaN,Queenstown,no,False
176,0,3,male,NaN,3,...,True,NaN,Southampton,no,False
182,0,3,male,9.0,4,...,False,NaN,Southampton,no,False
229,0,3,female,NaN,3,...,False,NaN,Southampton,no,False
233,1,3,female,5.0,4,...,False,NaN,Southampton,yes,False
261,1,3,male,3.0,4,...,False,NaN,Southampton,yes,False
266,0,3,male,16.0,4,...,True,NaN,Southampton,no,False
278,0,3,male,7.0,4,...,False,NaN,Queenstown,no,False
341,1,1,female,24.0,3,...,False,C,Southampton,yes,False
374,0,3,female,3.0,3,...,False,NaN,Southampton,no,False
386,0,3,male,1.0,5,...,False,NaN,Southampton,no,False
409,0,3,female,NaN,3,...,False,NaN,Southampton,no,False
480,0,3,male,9.0,5,...,False,NaN,Southampton,no,False
485,0,3,female,NaN,3,...,False,NaN,Southampton,no,False
541,0,3,female,9.0,4,...,False,NaN,Southampton,no,False
542,0,3,female,11.0,4,...,False,NaN,Southampton,no,False
634,0,3,female,9.0,3,...,False,NaN,Southampton,no,False
642,0,3,female,2.0,3,...,False,NaN,Southampton,no,False
683,0,3,male,14.0,5,...,False,NaN,Southampton,no,False
686,0,3,male,14.0,4,...,False,NaN,Southampton,no,False
726,1,2,female,30.0,3,...,False,NaN,Southampton,yes,False
787,0,3,male,8.0,4,...,False,NaN,Queenstown,no,False
813,0,3,female,6.0,4,...,False,NaN,Southampton,no,False
819,0,3,male,10.0,3,...,False,NaN,Southampton,no,False
824,0,3,male,2.0,4,...,False,NaN,Southampton,no,False
850,0,3,male,4.0,4,...,False,NaN,Southampton,no,False

In [21]:
filter_isin=df['sibsp'].isin([3,4,5])

In [23]:
df[filter_isin].head()

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []

[0 rows x 15 columns]

In [24]:
# 라이브러리 불러오기
import pandas as pd

# 중복 데이터를 갖는 데이터프레임 만들기
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})
print(df)
print('\n')

# 데이터프레임 전체 행 데이터 중에서 중복값 찾기
df_dup = df.duplicated()
print(df_dup)
print('\n')

# 데이터프레임의 특정 열 데이터에서 중복값 찾기
col_dup = df['c2'].duplicated()
print(col_dup)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2


0    False
1     True
2    False
3    False
4    False
dtype: bool


0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

In [27]:
pd.concat([df])

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [28]:
pd.concat([df1.sr1],axis=1)

NameError: name 'df1' is not defined

In [36]:
df1=pd.read_excel('./stock price.xlsx')
df2=pd.read_excel('./stock valuation.xlsx')

In [37]:
df1

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280     녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400      쿠쿠홀딩스  179204.666667  177500
8  199800         툴젠   -2514.333333  115400
9  204210     모두투어리츠    3093.333333    3475

In [38]:
df2

       id       name           eps     bps        per       pbr
0  130960     CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480         하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480        이마트  18268.166667  295780  13.931338  0.860437
4  145990        삼양사   5741.000000  108090  14.283226  0.758627
5  161390      한국타이어   5648.500000   51341   7.453306  0.820007
6  181710  NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750        종근당   3990.333333   40684  25.185866  2.470259
8  204210     모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940   삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [39]:
pd.merge(df1,df2)

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,이마트,239230.833333,254500,이마트,18268.166667,295780,13.931338,0.860437
2,145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090,14.283226,0.758627
3,185750,종근당,40293.666667,100500,종근당,3990.333333,40684,25.185866,2.470259
4,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

In [41]:
pd.merge(df1,df2, how='left', left_on='stock_name', right_on='name')

,id_x,stock_name,value,price,id_y,name,eps,bps,per,pbr
0,128940,한미약품,59385.666667,421000,NaN,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900,130960.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,엔에스쇼핑,14558.666667,13200,NaN,NaN,NaN,NaN,NaN,NaN
3,139480,이마트,239230.833333,254500,139480.0,이마트,18268.166667,295780.0,13.931338,0.860437
4,142280,녹십자엠에스,468.833333,10200,NaN,NaN,NaN,NaN,NaN,NaN
5,145990,삼양사,82750.000000,82000,145990.0,삼양사,5741.000000,108090.0,14.283226,0.758627
6,185750,종근당,40293.666667,100500,185750.0,종근당,3990.333333,40684.0,25.185866,2.470259
7,192400,쿠쿠홀딩스,179204.666667,177500,NaN,NaN,NaN,NaN,NaN,NaN
8,199800,툴젠,-2514.333333,115400,NaN,NaN,NaN,NaN,NaN,NaN
9,204210,모두투어리츠,3093.333333,3475,204210.0,모두투어리츠,85.166667,5335.0,40.802348,0.651359

In [42]:
pd.merge(df1,df2, how='right', left_on='stock_name', right_on='name')

,id_x,stock_name,value,price,id_y,name,eps,bps,per,pbr
0,130960.0,CJ E&M,58540.666667,98900.0,130960,CJ E&M,6301.333333,54068,15.695091,1.829178
1,NaN,NaN,NaN,NaN,136480,하림,274.166667,3551,11.489362,0.887074
2,NaN,NaN,NaN,NaN,138040,메리츠금융지주,2122.333333,14894,6.313806,0.899691
3,139480.0,이마트,239230.833333,254500.0,139480,이마트,18268.166667,295780,13.931338,0.860437
4,145990.0,삼양사,82750.000000,82000.0,145990,삼양사,5741.000000,108090,14.283226,0.758627
5,NaN,NaN,NaN,NaN,161390,한국타이어,5648.500000,51341,7.453306,0.820007
6,NaN,NaN,NaN,NaN,181710,NHN엔터테인먼트,2110.166667,78434,30.755864,0.827447
7,185750.0,종근당,40293.666667,100500.0,185750,종근당,3990.333333,40684,25.185866,2.470259
8,204210.0,모두투어리츠,3093.333333,3475.0,204210,모두투어리츠,85.166667,5335,40.802348,0.651359
9,NaN,NaN,NaN,NaN,207940,삼성바이오로직스,4644.166667,60099,89.790059,6.938551

In [43]:
df1.price #df1에서 가격속성 지닌것만 가져옴

0    421000
1     98900
2     13200
3    254500
4     10200
5     82000
6    100500
7    177500
8    115400
9      3475
Name: price, dtype: int64

In [44]:
df1.price<5000 #df1에서 5000보다 작은것을 불린값으로 보여줌

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: price, dtype: bool

In [46]:
price = df1[df1.price<5000] #df1에서 df1.price에서 TRUE만 가져옴
price

       id stock_name        value  price
9  204210     모두투어리츠  3093.333333   3475

In [48]:
pd.merge(price, df2)

,id,stock_name,value,price,name,eps,bps,per,pbr
0,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

In [49]:
df3=df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['id'], dtype='object')

In [51]:
df4=df1.join(df2,how='inner')
df4

ValueError: columns overlap but no suffix specified: Index(['id'], dtype='object')

In [62]:
titanic=df[df=sns.load_dataset('titanic')]
titanic

SyntaxError: invalid syntax (<ipython-input-62-69d2b53c5a91>, line 1)

In [57]:
df=titanic.loc[:, ['age', 'sex', 'class', 'fare', 'servived'] ]
df

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Index(['servived'], dtype='object'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

In [58]:
group_class = df.groupby(['class'])
print(group_class)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000029DB2FEAD60>

In [59]:
for k, g in group_class:
    print('*key:', key)
    print('*number', len(group_class))
    print(group_class.head())

NameError: name 'key' is not defined

In [63]:
grouped=df.groupby(['class'])

In [64]:
len(grouped)

3

In [65]:
grouped.std() # 표준편차 standard deviation

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
class,,,,,,,,
First,0.484026,0.0,14.802856,0.611898,0.693997,78.380373,0.498555,0.501140
Second,0.500623,0.0,14.001077,0.601633,0.690963,13.417399,0.499911,0.497081
Third,0.428949,0.0,12.495398,1.374883,0.888861,11.778142,0.477552,0.474233

In [66]:
grouped.mean()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
class,,,,,,,,
First,0.629630,1.0,38.233441,0.416667,0.356481,84.154687,0.550926,0.504630
Second,0.472826,2.0,29.877630,0.402174,0.380435,20.662183,0.538043,0.565217
Third,0.242363,3.0,25.140620,0.615071,0.393075,13.675550,0.649695,0.659878

In [67]:
grouped.age.mean()

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64

In [68]:
grouped.fare.std()

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [69]:
def min_max(x):
    return x.max()-x.min()

In [71]:
grouped.agg(['min','max'])

       survived     pclass         sex  ... adult_male alive       alone
            min max    min max     min  ...        max   min  max    min   max
class                                   ...
First         0   1      1   1  female  ...       True    no  yes  False  True
Second        0   1      2   2  female  ...       True    no  yes  False  True
Third         0   1      3   3  female  ...       True    no  yes  False  True

[3 rows x 22 columns]

In [73]:
grouped.agg(min_max)

        survived  pclass    age  sibsp  parch      fare
class
First          1       0  79.08      3      4  512.3292
Second         1       0  69.33      3      3   73.5000
Third          1       0  73.58      8      6   69.5500

In [75]:
grouped.agg({'fare':['min', 'max'], 'age':'mean'})

       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620